In [2]:
from collections import defaultdict as dd
import os
import json
import sqlite3
import ast
import re
from sqlite3 import Error
from collections import Counter

def read_json(file):
    with open(file) as json_file:
        json_data = json.load(json_file)
    
    return json_data

def read_jsonl(file):
    with open(file) as json_file:
        json_data = [json.loads(line) for line in json_file]
    
    return json_data

In [5]:
bs="6"
qv_link="false"
dist_relation="true"
orthog="false"
orth_init="false"
bi_way="true"
bi_match="true"

exp = f'bs={bs},qv_link={qv_link},dist={dist_relation},orthog={orthog},orth_init={orth_init},bi_way={bi_way},bi_match={bi_match}'
ratsql_infereval_loc = f'logdir/bert_run/{exp}/ie_dirs/'
ratsql_train = 'rat-sql/data/spider/train_spider.json'
ratsql_train_others = 'rat-sql/data/spider/train_others.json'
# step = [1] + [(5000 * x) + 100 for x in range(1, 17)] + [81000]
step = 60500
ratsql_infer = os.path.join(ratsql_infereval_loc, f'bert_run_true_1-step{step}.infer')
ratsql_eval  = os.path.join(ratsql_infereval_loc, f'bert_run_true_1-step{step}.eval')

In [6]:
ratsql_eval  = os.path.join(ratsql_infereval_loc, f'bert_run_true_1-step{step}.eval')

evaluation = read_jsonl(ratsql_eval)[0]

In [8]:
per_item = evaluation['per_item']

In [10]:
for p in per_item:
    exact = p['exact']
    if exact:
        print(f"predicted: {p['predicted']}")
        print(f"gold: {p['gold']}")

predicted: SELECT Count(*) FROM singer
gold: SELECT count(*) FROM singer
predicted: SELECT Count(*) FROM singer
gold: SELECT count(*) FROM singer
predicted: SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age Desc
gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC
predicted: SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age Desc
gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC
predicted: SELECT Avg(singer.Age), Min(singer.Age), Max(singer.Age) FROM singer WHERE singer.Country = 'terminal'
gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
predicted: SELECT singer.Song_Name, singer.Song_release_year FROM singer ORDER BY singer.Age Asc LIMIT 1
gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
predicted: SELECT singer.Song_Name, singer.Song_release_year FROM singer ORDER BY singer.Age Asc LIMIT 1
gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
predicted: SELECT DISTINCT singer.Country FROM singer WHERE singer.Age > 'terminal'
gold: SELECT DISTINCT country FROM singer WHERE age  >  20
predicted: SELECT DISTINCT singer.Country FROM singer WHERE singer.Age > 'terminal'
gold: SELECT DISTINCT country FROM singer WHERE age  >  20
predicted: SELECT singer.Country, Count(*) FROM singer GROUP BY singer.Country
gold: SELECT country ,  count(*) FROM singer GROUP BY country
predicted: SELECT singer.Country, Count(*) FROM singer GROUP BY singer.Country
gold: SELECT country ,  count(*) FROM singer GROUP BY country
predicted: SELECT singer.Song_Name FROM singer WHERE singer.Age > (SELECT Avg(singer.Age) FROM singer)
gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
predicted: SELECT singer.Song_Name FROM singer WHERE singer.Age > (SELECT Avg(singer.Age) FROM singer)
gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
predicted: SELECT stadium.Location, stadium.Name FROM stadium WHERE stadium.Capacity BETWEEN 'terminal' AND 'terminal'
gold: SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
predicted: SELECT stadium.Location, stadium.Name FROM stadium WHERE stadium.Capacity BETWEEN 'terminal' AND 'terminal'
gold: SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
predicted: SELECT Count(*) FROM concert WHERE concert.Year = 'terminal' OR concert.Year = 'terminal'
gold: SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
predicted: SELECT Count(*) FROM concert WHERE concert.Year = 'terminal' OR concert.Year = 'terminal'
gold: SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
predicted: SELECT stadium.Name, Count(*) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID GROUP BY concert.Stadium_ID
gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
predicted: SELECT stadium.Name, Count(*) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID GROUP BY stadium.Stadium_ID
gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
predicted: SELECT stadium.Name, stadium.Capacity FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year >= 'terminal' GROUP BY concert.Stadium_ID ORDER BY Count(*) Desc LIMIT 1
gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
predicted: SELECT concert.Year FROM concert GROUP BY concert.Year ORDER BY Count(*) Desc LIMIT 1
gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
predicted: SELECT concert.Year FROM concert GROUP BY concert.Year ORDER BY Count(*) Desc LIMIT 1
gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
predicted: SELECT stadium.Name FROM stadium WHERE stadium.Stadium_ID NOT IN (SELECT concert.Stadium_ID FROM concert)
gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
predicted: SELECT stadium.Name FROM stadium WHERE stadium.Stadium_ID NOT IN (SELECT concert.Stadium_ID FROM concert)
gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
predicted: SELECT singer.Country FROM singer WHERE singer.Age > 'terminal' INTERSECT SELECT singer.Country FROM singer WHERE singer.Age < 'terminal'
gold: SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
predicted: SELECT stadium.Name FROM stadium EXCEPT SELECT stadium.Name FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 'terminal'
gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
predicted: SELECT concert.concert_Name, concert.Theme, Count(*) FROM concert JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY singer_in_concert.concert_ID
gold: SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id
predicted: SELECT concert.concert_Name, concert.Theme, Count(*) FROM concert JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY singer_in_concert.concert_ID
gold: select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id
predicted: SELECT singer.Name, Count(*) FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID GROUP BY singer.Singer_ID
gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
predicted: SELECT singer.Name, Count(*) FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID GROUP BY singer.Singer_ID
gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
predicted: SELECT singer.Name FROM singer JOIN concert JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID AND singer_in_concert.concert_ID = concert.concert_ID AND singer.Singer_ID = singer_in_concert.Singer_ID WHERE concert.Year = 'terminal'
gold: SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
predicted: SELECT singer.Name, singer.Country FROM singer WHERE singer.Song_Name LIKE 'terminal'
gold: SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
predicted: SELECT singer.Name, singer.Country FROM singer WHERE singer.Song_Name LIKE 'terminal'
gold: SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
predicted: SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 'terminal' INTERSECT SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 'terminal'
gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
predicted: SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 'terminal' INTERSECT SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 'terminal'
gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
predicted: SELECT Count(*) FROM Pets WHERE Pets.weight > 'terminal'
gold: SELECT count(*) FROM pets WHERE weight  >  10
predicted: SELECT Count(*) FROM Pets WHERE Pets.weight > 'terminal'
gold: SELECT count(*) FROM pets WHERE weight  >  10
predicted: SELECT Max(Pets.weight), Pets.PetType FROM Pets GROUP BY Pets.PetType
gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType
predicted: SELECT Max(Pets.weight), Pets.PetType FROM Pets GROUP BY Pets.PetType
gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType
predicted: SELECT Count(*) FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID AND Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Sex = 'terminal' AND Pets.PetType = 'terminal'
gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
predicted: SELECT Count(*) FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID AND Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Sex = 'terminal' AND Pets.PetType = 'terminal'
gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
predicted: SELECT Count(DISTINCT Pets.PetType) FROM Pets
gold: SELECT count(DISTINCT pettype) FROM pets
predicted: SELECT Count(DISTINCT Pets.PetType) FROM Pets
gold: SELECT count(DISTINCT pettype) FROM pets
predicted: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID AND Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'terminal' OR Pets.PetType = 'terminal'
gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
predicted: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID AND Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'terminal' OR Pets.PetType = 'terminal'
gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
predicted: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID AND Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'terminal' INTERSECT SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID AND Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'terminal'
gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'
predicted: SELECT Pets.PetType, Pets.weight FROM Pets ORDER BY Pets.pet_age Asc LIMIT 1
gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
predicted: SELECT Pets.PetID, Pets.weight FROM Pets WHERE Pets.pet_age > 'terminal'
gold: SELECT petid ,  weight FROM pets WHERE pet_age  >  1
predicted: SELECT Pets.PetID, Pets.weight FROM Pets WHERE Pets.pet_age > 'terminal'
gold: SELECT petid ,  weight FROM pets WHERE pet_age  >  1
predicted: SELECT Pets.PetType, Avg(Pets.pet_age), Max(Pets.pet_age) FROM Pets GROUP BY Pets.PetType
gold: SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
predicted: SELECT Pets.PetType, Avg(Pets.weight) FROM Pets GROUP BY Pets.PetType
gold: SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
predicted: SELECT Avg(Pets.weight), Pets.PetType FROM Pets GROUP BY Pets.PetType
gold: SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
predicted: SELECT Student.Fname, Student.Age FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID
gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
predicted: SELECT DISTINCT Student.Fname, Student.Age FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID
gold: SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
predicted: SELECT Has_Pet.PetID FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID WHERE Student.LName = 'terminal'
gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
predicted: SELECT Has_Pet.PetID FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID WHERE Student.LName = 'terminal'
gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
predicted: SELECT Student.Fname, Student.Sex FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID GROUP BY Has_Pet.StuID HAVING Count(*) > 'terminal'
gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
predicted: SELECT Student.Fname, Student.Sex FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID GROUP BY Has_Pet.StuID HAVING Count(*) > 'terminal'
gold: SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
predicted: SELECT Avg(Student.Age) FROM Student WHERE Student.StuID NOT IN (SELECT Has_Pet.StuID FROM Has_Pet)
gold: select avg(age) from student where stuid not in (select stuid from has_pet)
predicted: SELECT Avg(Student.Age) FROM Student WHERE Student.StuID NOT IN (SELECT Has_Pet.StuID FROM Has_Pet)
gold: select avg(age) from student where stuid not in (select stuid from has_pet)
predicted: SELECT Count(*) FROM continents
gold: SELECT count(*) FROM CONTINENTS;
predicted: SELECT Count(*) FROM continents
gold: SELECT count(*) FROM CONTINENTS;
predicted: SELECT continents.ContId, continents.Continent, Count(*) FROM continents JOIN countries ON continents.ContId = countries.Continent GROUP BY countries.Continent
gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
predicted: SELECT continents.ContId, continents.Continent, Count(*) FROM continents JOIN countries ON continents.ContId = countries.Continent GROUP BY countries.Continent
gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
predicted: SELECT Count(*) FROM countries
gold: SELECT count(*) FROM COUNTRIES;
predicted: SELECT Count(*) FROM countries
gold: SELECT count(*) FROM COUNTRIES;
predicted: SELECT car_makers.FullName, car_makers.Id, Count(*) FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker GROUP BY car_makers.Id
gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
predicted: SELECT car_makers.Maker FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker AND car_makers.Id = model_list.Maker JOIN car_names ON model_list.Model = car_names.Model JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Year = 'terminal'
gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';
predicted: SELECT DISTINCT car_makers.Maker FROM car_makers JOIN model_list ON car_makers.Id = model_list.Maker AND car_makers.Id = model_list.Maker JOIN car_names ON model_list.Model = car_names.Model JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Year = 'terminal'
gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';
predicted: SELECT DISTINCT model_list.Model FROM model_list JOIN car_names ON model_list.Model = car_names.Model JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Year > 'terminal'
gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;
predicted: SELECT DISTINCT model_list.Model FROM model_list JOIN car_names ON model_list.Model = car_names.Model JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE cars_data.Year > 'terminal'
gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;
predicted: SELECT countries.CountryName FROM countries JOIN car_makers ON countries.CountryId = car_makers.Country GROUP BY car_makers.Country ORDER BY Count(*) Desc LIMIT 1
gold: SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;
predicted: SELECT countries.CountryName FROM countries JOIN car_makers ON countries.CountryId = car_makers.Country GROUP BY car_makers.Country ORDER BY Count(*) Desc LIMIT 1
gold: SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;
predicted: SELECT cars_data.Accelerate FROM car_names JOIN cars_data ON car_names.MakeId = cars_data.Id WHERE car_names.Make = 'terminal'
gold: SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Make  =  'amc hornet sportabout (sw)';
predicted: SELECT Count(*) FROM countries JOIN car_makers ON countries.CountryId = car_makers.Country WHERE countries.CountryName = 'terminal'
gold: SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId WHERE T2.CountryName  =  'france';
predicted: SELECT Count(*) FROM countries JOIN car_makers ON countries.CountryId = car_makers.Country WHERE countries.CountryName = 'terminal'
gold: SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId WHERE T2.CountryName  =  'france';
predicted: SELECT Avg(cars_data.MPG) FROM cars_data WHERE cars_data.Cylinders = 'terminal'
gold: SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;
predicted: SELECT Avg(cars_data.MPG) FROM cars_data WHERE cars_data.Cylinders = 'terminal'
gold: SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;
predicted: SELECT Min(cars_data.Weight) FROM cars_data WHERE cars_data.Cylinders = 'terminal' AND cars_data.Year = 'terminal'
gold: select min(weight) from cars_data where cylinders  =  8 and year  =  1974
predicted: SELECT model_list.Maker, model_list.Model FROM model_list
gold: SELECT Maker ,  Model FROM MODEL_LIST;
predicted: SELECT model_list.Maker, model_list.Model FROM model_list
gold: SELECT Maker ,  Model FROM MODEL_LIST;
predicted: SELECT Count(*) FROM cars_data WHERE cars_data.Horsepower > 'terminal'
gold: SELECT count(*) FROM CARS_DATA WHERE horsepower  >  150;
predicted: SELECT Count(*) FROM cars_data WHERE cars_data.Horsepower > 'terminal'
gold: SELECT count(*) FROM CARS_DATA WHERE horsepower  >  150;
predicted: SELECT Avg(cars_data.Weight), cars_data.Year FROM cars_data GROUP BY cars_data.Year
gold: SELECT avg(Weight) ,  YEAR FROM CARS_DATA GROUP BY YEAR;
predicted: SELECT Avg(cars_data.Horsepower) FROM cars_data WHERE cars_data.Year < 'terminal'
gold: SELECT avg(horsepower) FROM CARS_DATA WHERE YEAR  <  1980;
predicted: SELECT Avg(cars_data.Horsepower) FROM cars_data WHERE cars_data.Year < 'terminal'
gold: select avg(horsepower) from cars_data where year  <  1980;

In [29]:
ratsql_eval  = os.path.join(ratsql_infereval_loc, f'bert_run_true_1-step{step}.eval')

evaluation = read_jsonl(ratsql_eval)[0]

In [30]:
per_item = evaluation['per_item']

for pi in per_item:
    print(pi['exact'])
    print(pi['predicted'])
    print(pi['gold'])
    print('='*30)

0
SELECT Count(DISTINCT singer.Name) FROM singer
SELECT count(*) FROM singer
==============================
0
SELECT Count(DISTINCT singer_in_concert.Singer_ID) FROM singer_in_concert
SELECT count(*) FROM singer
==============================
0
SELECT stadium.Name, singer.Country, singer.Age FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID ORDER BY singer.Age Desc
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
==============================
0
SELECT stadium.Name, singer.Country, singer.Age FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID ORDER BY singer.Age Desc
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
==============================
0
SELECT Avg(stadium.Average), Min(singer.Age), Max(singer.Age) FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID WHERE singer.Country = 'terminal'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
==============================
0
SELECT Avg(stadium.Average), Min(singer.Age), Max(singer.Age) FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID WHERE singer.Country = 'terminal'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
==============================
0
SELECT singer.Name, concert.Year FROM singer JOIN concert JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID AND singer_in_concert.concert_ID = concert.concert_ID AND singer.Singer_ID = singer_in_concert.Singer_ID ORDER BY concert.Year Asc LIMIT 1
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
==============================
0
SELECT singer.Name, concert.Year FROM singer JOIN concert JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID AND singer_in_concert.concert_ID = concert.concert_ID AND singer.Singer_ID = singer_in_concert.Singer_ID ORDER BY concert.Year Asc LIMIT 1
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
==============================
True
SELECT DISTINCT singer.Country FROM singer WHERE singer.Age > 'terminal'
SELECT DISTINCT country FROM singer WHERE age  >  20
==============================
True
SELECT DISTINCT singer.Country FROM singer WHERE singer.Age > 'terminal'
SELECT DISTINCT country FROM singer WHERE age  >  20
==============================
0
SELECT singer.Country, Count(singer.Country) FROM singer GROUP BY singer.Country
SELECT country ,  count(*) FROM singer GROUP BY country
==============================
0
SELECT singer.Country, Count(singer.Country) FROM singer GROUP BY singer.Country
SELECT country ,  count(*) FROM singer GROUP BY country
==============================
0
SELECT singer.Song_Name FROM singer WHERE singer.Age > (SELECT Avg(singer.Age) FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID)
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
==============================
0
SELECT singer.Song_Name FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID WHERE singer.Age > (SELECT Avg(singer.Age) FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID)
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
==============================
True
SELECT stadium.Location, stadium.Name FROM stadium WHERE stadium.Capacity BETWEEN 'terminal' AND 'terminal'
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
==============================
0
SELECT stadium.Location, singer.Name FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID AND concert.concert_ID = singer_in_concert.concert_ID WHERE stadium.Capacity BETWEEN 'terminal' AND 'terminal'
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
==============================
0
SELECT Max(stadium.Capacity), Avg(stadium.Average) FROM stadium
select max(capacity), average from stadium
==============================
0
SELECT Avg(stadium.Average), Max(stadium.Capacity) FROM stadium
select avg(capacity) ,  max(capacity) from stadium
==============================
0
SELECT singer.Name, stadium.Capacity FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID ORDER BY stadium.Average Desc LIMIT 1
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
==============================
0
SELECT singer.Name, stadium.Capacity FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID ORDER BY stadium.Average Desc LIMIT 1
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
==============================
0
SELECT Count(stadium.Capacity) FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID WHERE singer.Age = 'terminal' OR concert.Year = 'terminal'
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
==============================
0
SELECT Count(stadium.Capacity) FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID WHERE singer.Age = 'terminal' OR singer.Age = 'terminal'
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
==============================
0
SELECT singer.Name, Count(concert.concert_Name) FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID GROUP BY stadium.Stadium_ID
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
==============================
0
SELECT stadium.Stadium_ID, Count(stadium.Stadium_ID) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID GROUP BY stadium.Stadium_ID
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
==============================
0
SELECT singer.Name, stadium.Capacity FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID WHERE concert.Year >= 'terminal' GROUP BY concert.Stadium_ID ORDER BY Count(concert.Year) Desc LIMIT 1
SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
==============================
0
SELECT singer.Name, stadium.Capacity FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID WHERE singer.Age > 'terminal' GROUP BY concert.Stadium_ID ORDER BY Count(concert.Stadium_ID) Desc LIMIT 1
select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1
==============================
0
SELECT concert.Year FROM concert GROUP BY concert.Year ORDER BY Count(concert.Year) Desc LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
==============================
0
SELECT concert.Year FROM concert GROUP BY concert.Year ORDER BY Count(concert.Year) Desc LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
==============================
0
SELECT singer.Name FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID EXCEPT SELECT concert.Stadium_ID FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
==============================
0
SELECT singer.Name FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID EXCEPT SELECT stadium.Stadium_ID FROM stadium
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
==============================
0
SELECT singer.Country FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID WHERE singer.Age > 'terminal' INTERSECT SELECT singer.Country FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID AND concert.concert_ID = singer_in_concert.concert_ID WHERE stadium.Lowest < 'terminal'
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
==============================
0
SELECT singer.Name FROM singer JOIN concert JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID AND singer_in_concert.concert_ID = concert.concert_ID EXCEPT SELECT singer.Name FROM singer JOIN concert JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID AND singer_in_concert.concert_ID = concert.concert_ID AND singer.Singer_ID = singer_in_concert.Singer_ID WHERE singer_in_concert.concert_ID = 'terminal'
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
==============================
0
SELECT singer.Name FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID EXCEPT SELECT stadium.Stadium_ID FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID WHERE singer_in_concert.concert_ID = 'terminal'
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
==============================
0
SELECT stadium.Name, concert.Theme, Count(concert.Theme) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY singer_in_concert.concert_ID
SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id
==============================
0
SELECT stadium.Name, concert.Theme, Count(singer_in_concert.Singer_ID) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY singer_in_concert.concert_ID
select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id
==============================
0
SELECT stadium.Name, Count(singer_in_concert.concert_ID) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY singer_in_concert.Singer_ID
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
==============================
0
SELECT stadium.Name, Count(concert.concert_ID) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID GROUP BY stadium.Name
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
==============================
0
SELECT stadium.Name FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID AND concert.concert_ID = singer_in_concert.concert_ID WHERE singer.Age = 'terminal'
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
==============================
0
SELECT stadium.Name FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID AND concert.concert_ID = singer_in_concert.concert_ID WHERE singer.Age = 'terminal'
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
==============================
0
SELECT stadium.Name, singer.Country FROM stadium JOIN singer JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID AND singer_in_concert.Singer_ID = singer.Singer_ID AND concert.concert_ID = singer_in_concert.concert_ID WHERE singer.Song_Name LIKE 'terminal'
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
==============================
True
SELECT singer.Name, singer.Country FROM singer WHERE singer.Song_Name LIKE 'terminal'
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
==============================
True
SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 'terminal' INTERSECT SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE concert.Year = 'terminal'
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
==============================
0
SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID AND stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID WHERE singer_in_concert.concert_ID = 'terminal' INTERSECT SELECT stadium.Name, stadium.Location FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID JOIN singer_in_concert ON concert.concert_ID = singer_in_concert.concert_ID WHERE singer_in_concert.concert_ID = 'terminal'
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
==============================
0
SELECT Count(DISTINCT concert.concert_Name) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE stadium.Capacity = (SELECT Max(stadium.Capacity) FROM stadium)
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
==============================
0
SELECT Count(concert.concert_Name) FROM stadium JOIN concert ON stadium.Stadium_ID = concert.Stadium_ID WHERE stadium.Capacity = (SELECT Max(stadium.Capacity) FROM stadium)
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
==============================
0
SELECT Count(DISTINCT Pets.PetType) FROM Pets WHERE Pets.weight > 'terminal'
SELECT count(*) FROM pets WHERE weight  >  10
==============================
0
SELECT Count(Has_Pet.PetID) FROM Has_Pet JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.weight > 'terminal'
SELECT count(*) FROM pets WHERE weight  >  10
==============================
0
SELECT Pets.weight FROM Pets WHERE Pets.PetType = (SELECT Student.Age FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'terminal')
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
==============================
0
SELECT Pets.weight FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Pets.PetType = 'terminal' ORDER BY Student.Age Asc LIMIT 1
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
==============================
True
SELECT Max(Pets.weight), Pets.PetType FROM Pets GROUP BY Pets.PetType
SELECT max(weight) ,  petType FROM pets GROUP BY petType
==============================
0
SELECT Max(Pets.weight), Max(Pets.PetType) FROM Pets
SELECT max(weight) ,  petType FROM pets GROUP BY petType
==============================
0
SELECT Count(DISTINCT Pets.PetType) FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Age > 'terminal'
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
==============================
0
SELECT Count(Pets.PetType) FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Age > 'terminal'
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
==============================
0
SELECT Count(Pets.PetType) FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Sex = 'terminal' AND Pets.PetType = 'terminal'
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
==============================
0
SELECT Count(Pets.PetType) FROM Student JOIN Has_Pet ON Student.StuID = Has_Pet.StuID JOIN Pets ON Has_Pet.PetID = Pets.PetID WHERE Student.Sex = 'terminal' AND Pets.PetType = 'terminal'
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
==============================
True
SELECT Count(DISTINCT Pets.PetType) FROM Pets
SELECT count(DISTINCT pettype) FROM pets
==============================
True
SELECT Count(DISTINCT Pets.PetType) FROM Pets

In [3]:
bs="6"
loss="label_smooth"
qv_link="false"
dist_relation="true"
orthog="false"
orth_init="false"
bi_match="true"
bi_way="true"

'{"att": 1, "bert_lr": 3e-06, "bert_token_type": true, "bert_version": "bert-large-uncased-whole-word-masking", "bs": 6, "clause_order": null, "cv_link": true, "data_path": "rat-sql/data/spider/", "decoder_hidden_size": 512, "end_lr": 0, "end_with_from": true, "loss": "label_smooth", "lr": 0.000744, "max_steps": 121000, "num_batch_accumulated": 4, "num_layers": 8, "qv_link": '+qv_link+ ', "dist_relation": ' + dist_relation + ', "use_orthogonal": ' + orthog + ', "use_orth_init": '+orth_init+', "sc_link": true, "summarize_header": "avg", "use_align_loss": true, "use_align_mat": true, "use_column_type": false, "bi_match": '+bi_match+', "bi_way": '+bi_way+'}'

'{"att": 1, "bert_lr": 3e-06, "bert_token_type": true, "bert_version": "bert-large-uncased-whole-word-masking", "bs": 6, "clause_order": null, "cv_link": true, "data_path": "rat-sql/data/spider/", "decoder_hidden_size": 512, "end_lr": 0, "end_with_from": true, "loss": "label_smooth", "lr": 0.000744, "max_steps": 121000, "num_batch_accumulated": 4, "num_layers": 8, "qv_link": false, "dist_relation": true, "use_orthogonal": false, "use_orth_init": false, "sc_link": true, "summarize_header": "avg", "use_align_loss": true, "use_align_mat": true, "use_column_type": false, "bi_match": true, "bi_way": true}'

In [28]:
import numpy as np
import pandas as pd
import torch 
import torch.nn as nn
from pyvis.network import Network
from sklearn.metrics.pairwise import cosine_similarity

import itertools
from collections import defaultdict

import scipy
import sys
sys.path.append('rat-sql')
sys.path.append('../')

import attr
import _jsonnet
import json 

from ratsql.commands.infer import Inferer
import os

os.environ["CUDA_DEVICE_ORDER"]="PCI_BUS_ID" 
os.environ["CUDA_VISIBLE_DEVICES"]= "3"
os.environ['TF_ENABLE_ONEDNN_OPTS'] = "0"

os.chdir('/repo')

@attr.s
class InferConfig:
    config = attr.ib()
    config_args = attr.ib()
    logdir = attr.ib()
    section = attr.ib()
    beam_size = attr.ib()
    output = attr.ib()
    step = attr.ib()
    use_heuristic = attr.ib(default=False)
    mode = attr.ib(default="infer")
    limit = attr.ib(default=None)
    output_history = attr.ib(default=False)

bs="6"
qv_link="true"
dist_relation="false"
orthog="false"
orth_init="false"
bi_match="true"
bi_way="true"

infer_config = InferConfig(config='rat-sql/configs/spider/nl2code-bert.jsonnet', 
                            config_args='{"att": 1, "bert_lr": 3e-06, "bert_token_type": true, "bert_version": "bert-large-uncased-whole-word-masking", "bs": 6, "clause_order": null, "cv_link": true, "data_path": "rat-sql/data/spider/", "decoder_hidden_size": 512, "end_lr": 0, "end_with_from": true, "loss": "label_smooth", "lr": 0.000744, "max_steps": 121000, "num_batch_accumulated": 4, "num_layers": 8, "qv_link": '+qv_link+ ', "dist_relation": ' + dist_relation + ', "use_orthogonal": ' + orthog + ', "use_orth_init": '+orth_init+', "sc_link": true, "summarize_header": "avg", "use_align_loss": true, "use_align_mat": true, "use_column_type": false, "bi_match": '+bi_match+', "bi_way": '+bi_way+'}', 
                            logdir='rat-sql/logdir/bert_run', 
                            section='val',
                            beam_size=1, 
                            output='__LOGDIR__/ie_dirs/bert_run_true_1-step1.infer', 
                            step=1, use_heuristic=True, mode='infer', limit=None, output_history=False)

config = json.loads(_jsonnet.evaluate_file(infer_config.config, tla_codes={'args': infer_config.config_args}))

inferer = Inferer(config)

logdir = os.path.join(infer_config.logdir, config['model_name'])
step = 10500

model = inferer.load_model(logdir, step)

relation_k_emb_0 = model.state_dict()['encoder.encs_update.encoder.layers.0.relation_k_emb.weight'].cpu()
relation_k_emb_1 = model.state_dict()['encoder.encs_update.encoder.layers.1.relation_k_emb.weight'].cpu()
relation_k_emb_2 = model.state_dict()['encoder.encs_update.encoder.layers.2.relation_k_emb.weight'].cpu()
relation_k_emb_3 = model.state_dict()['encoder.encs_update.encoder.layers.3.relation_k_emb.weight'].cpu()
relation_k_emb_4 = model.state_dict()['encoder.encs_update.encoder.layers.4.relation_k_emb.weight'].cpu()
relation_k_emb_5 = model.state_dict()['encoder.encs_update.encoder.layers.5.relation_k_emb.weight'].cpu()
relation_k_emb_6 = model.state_dict()['encoder.encs_update.encoder.layers.6.relation_k_emb.weight'].cpu()
relation_k_emb_7 = model.state_dict()['encoder.encs_update.encoder.layers.7.relation_k_emb.weight'].cpu()

relation_ks = [relation_k_emb_0, relation_k_emb_1, relation_k_emb_2, relation_k_emb_3, relation_k_emb_4, relation_k_emb_5, relation_k_emb_6, relation_k_emb_7]

relation_v_emb_0 = model.state_dict()['encoder.encs_update.encoder.layers.0.relation_v_emb.weight'].cpu()
relation_v_emb_1 = model.state_dict()['encoder.encs_update.encoder.layers.1.relation_v_emb.weight'].cpu()
relation_v_emb_2 = model.state_dict()['encoder.encs_update.encoder.layers.2.relation_v_emb.weight'].cpu()
relation_v_emb_3 = model.state_dict()['encoder.encs_update.encoder.layers.3.relation_v_emb.weight'].cpu()
relation_v_emb_4 = model.state_dict()['encoder.encs_update.encoder.layers.4.relation_v_emb.weight'].cpu()
relation_v_emb_5 = model.state_dict()['encoder.encs_update.encoder.layers.5.relation_v_emb.weight'].cpu()
relation_v_emb_6 = model.state_dict()['encoder.encs_update.encoder.layers.6.relation_v_emb.weight'].cpu()
relation_v_emb_7 = model.state_dict()['encoder.encs_update.encoder.layers.7.relation_v_emb.weight'].cpu()

relation_vs = [relation_v_emb_0, relation_v_emb_1, relation_v_emb_2, relation_v_emb_3, relation_v_emb_4, relation_v_emb_5, relation_v_emb_6, relation_v_emb_7]

relation_index = {('qq_dist', -2): 0,
                    ('qq_dist', -1): 1,
                    ('qq_dist', 0): 2,
                    ('qq_dist', 1): 3,
                    ('qq_dist', 2): 4,
                    'qc_default': 5,
                    'qt_default': 6,
                    'cq_default': 7,
                    'cc_default': 8,
                    'cc_foreign_key_forward': 9,
                    'cc_foreign_key_backward': 10,
                    'cc_table_match': 11,
                    ('cc_dist', -2): 12,
                    ('cc_dist', -1): 13,
                    ('cc_dist', 0): 14,
                    ('cc_dist', 1): 15,
                    ('cc_dist', 2): 16,
                    'ct_default': 17,
                    'ct_foreign_key': 18,
                    'ct_primary_key': 19,
                    'ct_table_match': 20,
                    'ct_any_table': 21,
                    'tq_default': 22,
                    'tc_default': 23,
                    'tc_primary_key': 24,
                    'tc_table_match': 25,
                    'tc_any_table': 26,
                    'tc_foreign_key': 27,
                    'tt_default': 28,
                    'tt_foreign_key_forward': 29,
                    'tt_foreign_key_backward': 30,
                    'tt_foreign_key_both': 31,
                    ('tt_dist', -2): 32,
                    ('tt_dist', -1): 33,
                    ('tt_dist', 0): 34,
                    ('tt_dist', 1): 35,
                    ('tt_dist', 2): 36,
                    'qcCEM': 37,
                    'cqCEM': 38,
                    'qtTEM': 39,
                    'tqTEM': 40,
                    'qcCPM': 41,
                    'cqCPM': 42,
                    'qtTPM': 43,
                    'tqTPM': 44,
                    'qcNUMBER': 45,
                    'cqNUMBER': 46,
                    'qcTIME': 47,
                    'cqTIME': 48,
                    'qcCELLMATCH': 49,
                    'cqCELLMATCH': 50}

relation_index_list = list(relation_index.keys())

print(f'bs: {bs}, qv_link: {qv_link}, dist_relation: {dist_relation}, orthog: {orthog}, orth_init: {orth_init}, bi_match: {bi_match}, bi_way: {bi_way}')

WARNING <class 'ratsql.models.enc_dec.EncDecModel.Preproc'>: superfluous {'name': 'EncDec'}
WARNING <class 'ratsql.models.enc_dec.EncDecModel'>: superfluous {'decoder_preproc': {'grammar': {'clause_order': None, 'end_with_from': True, 'factorize_sketch': 2, 'include_literals': False, 'infer_from_conditions': True, 'name': 'spider', 'output_from': True, 'use_table_pointer': True}, 'save_path': 'rat-sql/data/spider/nl2code,output_from=true,fs=2,emb=bert,cvlink', 'use_seq_elem_rules': True}, 'encoder_preproc': {'bert_version': 'bert-large-uncased-whole-word-masking', 'compute_cv_link': True, 'compute_sc_link': True, 'db_path': 'rat-sql/data/spider/database', 'fix_issue_16_primary_keys': True, 'include_table_name_in_column': False, 'save_path': 'rat-sql/data/spider/nl2code,output_from=true,fs=2,emb=bert,cvlink'}}
WARNING <class 'ratsql.models.spider.spider_enc.SpiderEncoderBert'>: superfluous {'enc_qv_link': True, 'qv_link': True, 'use_orthogonal': False}

Used Relations: 46

Some weights of the model checkpoint at bert-large-uncased-whole-word-masking were not used when initializing BertModel: ['cls.predictions.bias', 'cls.predictions.transform.LayerNorm.bias', 'cls.predictions.transform.LayerNorm.weight', 'cls.predictions.transform.dense.weight', 'cls.predictions.transform.dense.bias', 'cls.seq_relationship.weight', 'cls.seq_relationship.bias', 'cls.predictions.decoder.weight']
- This IS expected if you are initializing BertModel from the checkpoint of a model trained on another task or with another architecture (e.g. initializing a BertForSequenceClassification model from a BertForPreTraining model).
- This IS NOT expected if you are initializing BertModel from the checkpoint of a model that you expect to be exactly identical (initializing a BertForSequenceClassification model from a BertForSequenceClassification model).

Loading model from rat-sql/logdir/bert_run/bs=6,qv_link=true,dist=false,orthog=false,orth_init=false,bi_way=true,bi_match=true/model_checkpoint-00010500
bs: 6, qv_link: true, dist_relation: false, orthog: false, orth_init: false, bi_match: true, bi_way: true

In [27]:
model.encoder.encs_update.relation_ids

{'qq_default': 0,
 'qc_default': 1,
 'qt_default': 2,
 'cc_default': 3,
 'cc_foreign_key_forward': 4,
 'cc_table_match': 5,
 'ct_default': 6,
 'ct_foreign_key': 7,
 'ct_primary_key': 8,
 'ct_table_match': 9,
 'ct_any_table': 10,
 'tt_default': 11,
 'tt_foreign_key_forward': 12,
 'qcCEM': 13,
 'qtTEM': 14,
 'qcNUMBER': 15,
 'qcTIME': 16,
 'qcCELLMATCH': 17}

In [ ]:
read_jsonl()